{
  "scan_metadata": {
    "github_repo_name": "vggt",
    "paper_name": "VGGT: Visual Geometry Grounded Transformer",
    "scan_date": "2025-01-22",
    "total_files_scanned": 8,
    "total_files_included_in_tools": 4,
    "success": true,
    "success_reason": "Successfully identified 4 high-quality tutorials suitable for tool extraction"
  },
  "tutorials": [
    {
      "path": "README.md",
      "title": "VGGT: Visual Geometry Grounded Transformer - Main Documentation",
      "description": "Comprehensive documentation for VGGT including quick start guide, detailed usage examples, and integration instructions. Contains complete code examples for model initialization, image preprocessing, and prediction extraction. Serves as the primary entry point for users learning to use VGGT for 3D reconstruction tasks.",
      "type": "documentation",
      "include_in_tools": true,
      "reason_for_include_or_exclude": "Excellent tutorial value with complete working examples, clear explanations, and comprehensive coverage of core VGGT functionality including camera pose estimation, depth prediction, and point cloud generation."
    },
    {
      "path": "demo_gradio.py",
      "title": "Interactive 3D Visualization Demo with Gradio Web Interface",
      "description": "Complete interactive demo application providing web-based interface for VGGT 3D reconstruction. Implements full pipeline from image/video upload to 3D visualization with real-time parameter adjustment. Demonstrates model inference, post-processing, and interactive 3D scene exploration with camera controls and filtering options.",
      "type": "script",
      "include_in_tools": true,
      "reason_for_include_or_exclude": "High educational value as complete end-to-end application showing VGGT integration, web interface design, and 3D visualization. Contains reusable components for model inference, data handling, and interactive visualization."
    },
    {
      "path": "demo_viser.py",
      "title": "3D Point Cloud Visualization with Viser",
      "description": "Standalone visualization demo using Viser for interactive 3D point cloud and camera pose visualization. Provides complete workflow from image loading through VGGT inference to 3D scene visualization. Includes advanced features like sky segmentation, confidence filtering, and camera frustum display.",
      "type": "script",
      "include_in_tools": true,
      "reason_for_include_or_exclude": "Excellent tutorial showing VGGT integration with 3D visualization tools. Contains modular functions for model inference, point cloud processing, and interactive visualization that are highly reusable for scientific applications."
    },
    {
      "path": "demo_colmap.py",
      "title": "COLMAP Export and Bundle Adjustment Demo",
      "description": "Advanced demonstration of VGGT integration with COLMAP format export and optional bundle adjustment optimization. Shows complete pipeline from image preprocessing to 3D reconstruction with camera pose refinement. Includes support for track prediction, bundle adjustment, and standard COLMAP output format.",
      "type": "script",
      "include_in_tools": true,
      "reason_for_include_or_exclude": "High-value tutorial demonstrating advanced VGGT features including bundle adjustment, track prediction, and COLMAP integration. Essential for users wanting to integrate VGGT with existing 3D reconstruction pipelines."
    }
  ]
}