{
  "scan_metadata": {
    "github_repo_name": "vggt",
    "paper_name": "VGGT: Visual Geometry Grounded Transformer",
    "scan_date": "2025-01-22",
    "total_files_scanned": 8,
    "total_files_included_in_tools": 4,
    "success": true,
    "success_reason": "Successfully scanned VGGT codebase and identified high-quality tutorial materials"
  },
  "tutorials": [
    {
      "path": "README.md",
      "title": "VGGT: Visual Geometry Grounded Transformer - Main Documentation",
      "description": "Comprehensive documentation for VGGT including quick start guide, detailed usage examples, and integration instructions. Contains complete code examples for model initialization, image preprocessing, and prediction extraction. Serves as the primary entry point for users learning to use VGGT for 3D reconstruction tasks.",
      "type": "documentation",
      "include_in_tools": true,
      "reason_for_include_or_exclude": "Excellent tutorial value with complete working examples, clear explanations, and comprehensive coverage of core VGGT functionality including camera pose estimation, depth prediction, and point cloud generation."
    },
    {
      "path": "demo_gradio.py",
      "title": "Interactive 3D Visualization Demo with Gradio Web Interface",
      "description": "Complete interactive demo application providing web-based interface for VGGT 3D reconstruction. Implements full pipeline from image/video upload to 3D visualization with real-time parameter adjustment. Demonstrates model inference, post-processing, and interactive 3D scene exploration with camera controls and filtering options.",
      "type": "script",
      "include_in_tools": true,
      "reason_for_include_or_exclude": "High educational value as complete end-to-end application showing VGGT integration, web interface design, and 3D visualization. Contains reusable components for model inference, data handling, and interactive visualization."
    },
    {
      "path": "demo_viser.py",
      "title": "3D Point Cloud Visualization with Viser",
      "description": "Standalone visualization demo using Viser for interactive 3D point cloud and camera pose visualization. Provides complete workflow from image loading through VGGT inference to 3D scene visualization. Includes advanced features like sky segmentation, confidence filtering, and camera frustum display.",
      "type": "script",
      "include_in_tools": true,
      "reason_for_include_or_exclude": "Excellent tutorial showing VGGT integration with 3D visualization tools. Contains modular functions for model inference, point cloud processing, and interactive visualization that are highly reusable for scientific applications."
    },
    {
      "path": "demo_colmap.py",
      "title": "COLMAP Export and Bundle Adjustment Demo",
      "description": "Advanced demonstration of VGGT integration with COLMAP format export and optional bundle adjustment optimization. Shows complete pipeline from image preprocessing to 3D reconstruction with camera pose refinement. Includes support for track prediction, bundle adjustment, and standard COLMAP output format.",
      "type": "script",
      "include_in_tools": true,
      "reason_for_include_or_exclude": "High-value tutorial demonstrating advanced VGGT features including bundle adjustment, track prediction, and COLMAP integration. Essential for users wanting to integrate VGGT with existing 3D reconstruction pipelines."
    },
    {
      "path": "training/README.md",
      "title": "VGGT Training Framework Documentation",
      "description": "Comprehensive guide for training and fine-tuning VGGT models on custom datasets. Covers environment setup, dataset preparation, configuration management, and training procedures. Includes practical examples for Co3D dataset training and multi-dataset training scenarios.",
      "type": "documentation",
      "include_in_tools": false,
      "reason_for_include_or_exclude": "Focused on model training rather than inference usage. While valuable for researchers, it's not suitable for tool extraction as it requires complex training infrastructure and is not applicable to typical scientific data analysis workflows."
    },
    {
      "path": "docs/package.md",
      "title": "Alternative Installation Methods",
      "description": "Documentation covering different installation methods for VGGT package including pip, pixi, and uv installation approaches. Provides setup instructions and prerequisite requirements for different package managers.",
      "type": "documentation",
      "include_in_tools": false,
      "reason_for_include_or_exclude": "Installation documentation without executable code content. While useful for setup, it doesn't contain functionality that can be wrapped as analysis tools."
    },
    {
      "path": "visual_util.py",
      "title": "3D Visualization Utilities",
      "description": "Utility functions for converting VGGT predictions to 3D visualizations including GLB scene generation, point cloud processing, and camera visualization. Contains specialized functions for confidence filtering, sky segmentation, and background masking.",
      "type": "script",
      "include_in_tools": false,
      "reason_for_include_or_exclude": "Support utilities rather than standalone tutorial content. While the code is valuable, it's designed as helper functions for the demo scripts rather than independent tutorial material."
    },
    {
      "path": "CODE_OF_CONDUCT.md",
      "title": "Code of Conduct",
      "description": "Project code of conduct and community guidelines. Standard Meta Platforms open source project conduct policy for contributors and community members.",
      "type": "documentation",
      "include_in_tools": false,
      "reason_for_include_or_exclude": "Administrative documentation without executable code content or tutorial value for scientific applications."
    }
  ]
}